Potsdam-Sensors/ArduinoPackage/telosairBoards/telosairDuets/bootloaders/zero/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.separator=Print Separator

d_mk4.name=TelosAir Duet Mk4
d_mk4.vid.0=0x1B4F
d_mk4.pid.0=0x214F
d_mk4.vid.1=0x1B4F
d_mk4.pid.1=0x215F
d_mk4.upload.tool=bossac
d_mk4.upload.protocol=sam-ba
d_mk4.upload.maximum_size=262144
d_mk4.upload.use_1200bps_touch=true
d_mk4.upload.wait_for_upload_port=true
d_mk4.upload.native_usb=true
d_mk4.build.mcu=cortex-m0plus
d_mk4.build.f_cpu=48000000L
d_mk4.build.usb_product="Duet Mk4"
d_mk4.build.usb_manufacturer="TelosAir"
d_mk4.build.board=SAMD_ZERO
d_mk4.build.core=arduino
d_mk4.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
d_mk4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
d_mk4.build.openocdscript=openocd_scripts/arduino_zero.cfg
d_mk4.build.variant=mk4
d_mk4.build.variant_system_lib=
d_mk4.build.extra_combine_flags=
d_mk4.build.vid=0x1B4F
d_mk4.build.pid=0x214F
d_mk4.bootloader.tool=openocd
d_mk4.bootloader.file=zero/telosair_duet_mk4.bin
d_mk4.menu.separator.colon=Colon (:::)
d_mk4.menu.separator.space=Space (SPACE)
d_mk4.menu.separator.colon.compiler.cpp.extra_flags=-DPRINT_SEPARATOR=":::"
d_mk4.menu.separator.space.compiler.cpp.extra_flags=


d_mk3.name=TelosAir Duet Mk3
d_mk3.vid.0=0x1B4F
d_mk3.pid.0=0x214F
d_mk3.vid.1=0x1B4F
d_mk3.pid.1=0x215F
d_mk3.upload.tool=bossac
d_mk3.upload.protocol=sam-ba
d_mk3.upload.maximum_size=262144
d_mk3.upload.use_1200bps_touch=true
d_mk3.upload.wait_for_upload_port=true
d_mk3.upload.native_usb=true
d_mk3.build.mcu=cortex-m0plus
d_mk3.build.f_cpu=48000000L
d_mk3.build.usb_product="Duet Mk3"
d_mk3.build.usb_manufacturer="TelosAir"
d_mk3.build.board=SAMD_ZERO
d_mk3.build.core=arduino
d_mk3.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
d_mk3.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
d_mk3.build.openocdscript=openocd_scripts/arduino_zero.cfg
d_mk3.build.variant=mk3
d_mk3.build.variant_system_lib=
d_mk3.build.extra_combine_flags=
d_mk3.build.vid=0x1B4F
d_mk3.build.pid=0x214F
d_mk3.bootloader.tool=openocd
d_mk3.bootloader.file=zero/telosair_duet_mk3.bin

d_mk2.name=TelosAir Duet Mk2
d_mk2.vid.0=0x1B4F
d_mk2.pid.0=0x214F
d_mk2.vid.1=0x1B4F
d_mk2.pid.1=0x215F
d_mk2.upload.tool=bossac
d_mk2.upload.protocol=sam-ba
d_mk2.upload.maximum_size=262144
d_mk2.upload.use_1200bps_touch=true
d_mk2.upload.wait_for_upload_port=true
d_mk2.upload.native_usb=true
d_mk2.build.mcu=cortex-m0plus
d_mk2.build.f_cpu=48000000L
d_mk2.build.usb_product="Duet Mk2"
d_mk2.build.usb_manufacturer="TelosAir"
d_mk2.build.board=SAMD_ZERO
d_mk2.build.core=arduino
d_mk2.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
d_mk2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
d_mk2.build.openocdscript=openocd_scripts/arduino_zero.cfg
d_mk2.build.variant=mk2
d_mk2.build.variant_system_lib=
d_mk2.build.extra_combine_flags=
d_mk2.build.vid=0x1B4F
d_mk2.build.pid=0x214F
d_mk2.bootloader.tool=openocd
d_mk2.bootloader.file=zero/telosair_duet_mk1.bin

d_mk1.name=TelosAir Duet Mk1
d_mk1.vid.0=0x1B4F
d_mk1.pid.0=0x214F
d_mk1.vid.1=0x1B4F
d_mk1.pid.1=0x215F
d_mk1.upload.tool=bossac
d_mk1.upload.protocol=sam-ba
d_mk1.upload.maximum_size=262144
d_mk1.upload.use_1200bps_touch=true
d_mk1.upload.wait_for_upload_port=true
d_mk1.upload.native_usb=true
d_mk1.build.mcu=cortex-m0plus
d_mk1.build.f_cpu=48000000L
d_mk1.build.usb_product="Duet Mk1"
d_mk1.build.usb_manufacturer="TelosAir"
d_mk1.build.board=SAMD_ZERO
d_mk1.build.core=arduino
d_mk1.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
d_mk1.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
d_mk1.build.openocdscript=openocd_scripts/arduino_zero.cfg
d_mk1.build.variant=mk1
d_mk1.build.variant_system_lib=
d_mk1.build.extra_combine_flags=
d_mk1.build.vid=0x1B4F
d_mk1.build.pid=0x214F
d_mk1.bootloader.tool=openocd
d_mk1.bootloader.file=zero/telosair_duet_mk1.bin
